# Fabric Area Distribution Of Wires At Cover Property

Source: https://www.revitapidocs.com/2026/bdb93bcb-fbc2-af1f-d751-7e44bc37511c.htm

---

| Fabric Area Distribution Of Wires At Cover Property |
| --- |

The distribution of wires that is closest to the cover.
**Namespace:** Autodesk.Revit.DB.Structure
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public WireDistributionDirection DistributionOfWiresAtCover { get; set; }
```

```
Public Property DistributionOfWiresAtCover As WireDistributionDirection
	Get
	Set
```

```
public:
property WireDistributionDirection DistributionOfWiresAtCover {
	WireDistributionDirection get ();
	void set (WireDistributionDirection value);
}
```

```
member DistributionOfWiresAtCover : WireDistributionDirection with get, set
```

#### Property Value

WireDistributionDirection Exceptions

| Exception | Condition |
| --- | --- |
| ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |

See Also

#### Reference

FabricArea Class Autodesk.Revit.DB.Structure Namespace